*Environment - `gh-actions-dev`
Last action - `synchronize`
Status - terraform plan: `success`
Status - terraform apply: `failure`*

<details><summary>Plan output</summary>

```
terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/sf-terraform-actions/gh-actions-dev/runs/run-U5ut5t4azfUXpHiW

Waiting for the plan to start...

Terraform v1.9.3
on linux_amd64
Initializing plugins and modules...
╷
│ Warning: Argument is deprecated
│
│   with provider["registry.terraform.io/snowflake-labs/snowflake"],
│   on <empty> line 0:
│   (source code not available)
│
│ Specify the region as part of the account parameter
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.LIQUIBASE_TEST.snowflake_database.DATABASE will be created
  + resource "snowflake_database" "DATABASE" {
      + catalog                                       = (known after apply)
      + data_retention_time_in_days                   = 1
      + default_ddl_collation                         = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + id                                            = (known after apply)
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "LIQUIBASE_TEST"
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.LIQUIBASE_TEST.snowflake_schema.LIQUIBASE_SCHEMA[0] will be created
  + resource "snowflake_schema" "LIQUIBASE_SCHEMA" {
      + comment             = "Schema for managing Liquibase. Only the db deploy user has RW"
      + data_retention_days = 7
      + database            = "LIQUIBASE_TEST"
      + id                  = (known after apply)
      + is_managed          = true
      + is_transient        = false
      + name                = "LIQUIBASE"
    }

  # module.LIQUIBASE_TEST.snowflake_schema.SCHEMA["TEST_STUFF"] will be created
  + resource "snowflake_schema" "SCHEMA" {
      + data_retention_days = 1
      + database            = "LIQUIBASE_TEST"
      + id                  = (known after apply)
      + is_managed          = false
      + is_transient        = false
      + name                = "TEST_STUFF"
        # (1 unchanged attribute hidden)
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_database_role.ELEV_ROLE will be created
  + resource "snowflake_database_role" "ELEV_ROLE" {
      + database = "LIQUIBASE_TEST"
      + id       = (known after apply)
      + name     = "AR_TEST_STUFF_ELEV"
        # (1 unchanged attribute hidden)
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_database_role.EXEC_ROLE will be created
  + resource "snowflake_database_role" "EXEC_ROLE" {
      + database = "LIQUIBASE_TEST"
      + id       = (known after apply)
      + name     = "AR_TEST_STUFF_EXEC"
        # (1 unchanged attribute hidden)
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_database_role.RO_ROLE will be created
  + resource "snowflake_database_role" "RO_ROLE" {
      + database = "LIQUIBASE_TEST"
      + id       = (known after apply)
      + name     = "AR_TEST_STUFF_RO"
        # (1 unchanged attribute hidden)
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_database_role.RW_ROLE will be created
  + resource "snowflake_database_role" "RW_ROLE" {
      + database = "LIQUIBASE_TEST"
      + id       = (known after apply)
      + name     = "AR_TEST_STUFF_RW"
        # (1 unchanged attribute hidden)
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_database_role.GRANT_ELEV_DB_ROLE[0] will be created
  + resource "snowflake_grant_database_role" "GRANT_ELEV_DB_ROLE" {
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_ELEV"
      + id                 = (known after apply)
      + parent_role_name   = "LIQUIBASE_DEPLOY"
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_database_role.GRANT_EXEC_DB_ROLE[0] will be created
  + resource "snowflake_grant_database_role" "GRANT_EXEC_DB_ROLE" {
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_EXEC"
      + id                 = (known after apply)
      + parent_role_name   = "LIQUIBASE_DEPLOY"
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["SEQUENCES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "ELEV_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_ELEV"
      + id                 = (known after apply)
      + privileges         = [
          + "ALL",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.TEST_STUFF"
              + object_type_plural = "SEQUENCES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["TABLES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "ELEV_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_ELEV"
      + id                 = (known after apply)
      + privileges         = [
          + "ALL",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.TEST_STUFF"
              + object_type_plural = "TABLES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["VIEWS"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "ELEV_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_ELEV"
      + id                 = (known after apply)
      + privileges         = [
          + "ALL",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.TEST_STUFF"
              + object_type_plural = "VIEWS"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.ELEV_SCHEMA_GRANTS will be created
  + resource "snowflake_grant_privileges_to_database_role" "ELEV_SCHEMA_GRANTS" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_ELEV"
      + id                 = (known after apply)
      + privileges         = [
          + "CREATE FUNCTION",
          + "CREATE PROCEDURE",
          + "CREATE SEQUENCE",
          + "CREATE TABLE",
          + "CREATE VIEW",
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema {
          + schema_name = "LIQUIBASE_TEST.TEST_STUFF"
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.EXEC_FUTURE_GRANT["FUNCTIONS"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "EXEC_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_EXEC"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.TEST_STUFF"
              + object_type_plural = "FUNCTIONS"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.EXEC_FUTURE_GRANT["PROCEDURES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "EXEC_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_EXEC"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.TEST_STUFF"
              + object_type_plural = "PROCEDURES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.EXEC_SCHEMA_GRANTS will be created
  + resource "snowflake_grant_privileges_to_database_role" "EXEC_SCHEMA_GRANTS" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_EXEC"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema {
          + schema_name = "LIQUIBASE_TEST.TEST_STUFF"
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["SEQUENCES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RO_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_RO"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.TEST_STUFF"
              + object_type_plural = "SEQUENCES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["TABLES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RO_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_RO"
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.TEST_STUFF"
              + object_type_plural = "TABLES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["VIEWS"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RO_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_RO"
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.TEST_STUFF"
              + object_type_plural = "VIEWS"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RO_SCHEMA_GRANTS will be created
  + resource "snowflake_grant_privileges_to_database_role" "RO_SCHEMA_GRANTS" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_RO"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema {
          + schema_name = "LIQUIBASE_TEST.TEST_STUFF"
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["SEQUENCES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RW_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_RW"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.TEST_STUFF"
              + object_type_plural = "SEQUENCES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["TABLES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RW_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_RW"
      + id                 = (known after apply)
      + privileges         = [
          + "DELETE",
          + "INSERT",
          + "SELECT",
          + "TRUNCATE",
          + "UPDATE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.TEST_STUFF"
              + object_type_plural = "TABLES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["VIEWS"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RW_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_RW"
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.TEST_STUFF"
              + object_type_plural = "VIEWS"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RW_SCHEMA_GRANTS will be created
  + resource "snowflake_grant_privileges_to_database_role" "RW_SCHEMA_GRANTS" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_RW"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema {
          + schema_name = "LIQUIBASE_TEST.TEST_STUFF"
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_database_role.ELEV_ROLE will be created
  + resource "snowflake_database_role" "ELEV_ROLE" {
      + database = "LIQUIBASE_TEST"
      + id       = (known after apply)
      + name     = "AR_LIQUIBASE_ELEV"
        # (1 unchanged attribute hidden)
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_database_role.EXEC_ROLE will be created
  + resource "snowflake_database_role" "EXEC_ROLE" {
      + database = "LIQUIBASE_TEST"
      + id       = (known after apply)
      + name     = "AR_LIQUIBASE_EXEC"
        # (1 unchanged attribute hidden)
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_database_role.RO_ROLE will be created
  + resource "snowflake_database_role" "RO_ROLE" {
      + database = "LIQUIBASE_TEST"
      + id       = (known after apply)
      + name     = "AR_LIQUIBASE_RO"
        # (1 unchanged attribute hidden)
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_database_role.RW_ROLE will be created
  + resource "snowflake_database_role" "RW_ROLE" {
      + database = "LIQUIBASE_TEST"
      + id       = (known after apply)
      + name     = "AR_LIQUIBASE_RW"
        # (1 unchanged attribute hidden)
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_database_role.GRANT_ELEV_DB_ROLE[0] will be created
  + resource "snowflake_grant_database_role" "GRANT_ELEV_DB_ROLE" {
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_ELEV"
      + id                 = (known after apply)
      + parent_role_name   = "LIQUIBASE_DEPLOY"
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_database_role.GRANT_EXEC_DB_ROLE[0] will be created
  + resource "snowflake_grant_database_role" "GRANT_EXEC_DB_ROLE" {
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_EXEC"
      + id                 = (known after apply)
      + parent_role_name   = "LIQUIBASE_DEPLOY"
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["SEQUENCES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "ELEV_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_ELEV"
      + id                 = (known after apply)
      + privileges         = [
          + "ALL",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.LIQUIBASE"
              + object_type_plural = "SEQUENCES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["TABLES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "ELEV_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_ELEV"
      + id                 = (known after apply)
      + privileges         = [
          + "ALL",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.LIQUIBASE"
              + object_type_plural = "TABLES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["VIEWS"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "ELEV_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_ELEV"
      + id                 = (known after apply)
      + privileges         = [
          + "ALL",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.LIQUIBASE"
              + object_type_plural = "VIEWS"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.ELEV_SCHEMA_GRANTS will be created
  + resource "snowflake_grant_privileges_to_database_role" "ELEV_SCHEMA_GRANTS" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_ELEV"
      + id                 = (known after apply)
      + privileges         = [
          + "CREATE FUNCTION",
          + "CREATE PROCEDURE",
          + "CREATE SEQUENCE",
          + "CREATE TABLE",
          + "CREATE VIEW",
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema {
          + schema_name = "LIQUIBASE_TEST.LIQUIBASE"
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.EXEC_FUTURE_GRANT["FUNCTIONS"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "EXEC_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_EXEC"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.LIQUIBASE"
              + object_type_plural = "FUNCTIONS"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.EXEC_FUTURE_GRANT["PROCEDURES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "EXEC_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_EXEC"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.LIQUIBASE"
              + object_type_plural = "PROCEDURES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.EXEC_SCHEMA_GRANTS will be created
  + resource "snowflake_grant_privileges_to_database_role" "EXEC_SCHEMA_GRANTS" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_EXEC"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema {
          + schema_name = "LIQUIBASE_TEST.LIQUIBASE"
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["SEQUENCES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RO_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_RO"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.LIQUIBASE"
              + object_type_plural = "SEQUENCES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["TABLES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RO_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_RO"
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.LIQUIBASE"
              + object_type_plural = "TABLES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["VIEWS"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RO_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_RO"
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.LIQUIBASE"
              + object_type_plural = "VIEWS"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RO_SCHEMA_GRANTS will be created
  + resource "snowflake_grant_privileges_to_database_role" "RO_SCHEMA_GRANTS" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_RO"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema {
          + schema_name = "LIQUIBASE_TEST.LIQUIBASE"
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["SEQUENCES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RW_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_RW"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.LIQUIBASE"
              + object_type_plural = "SEQUENCES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["TABLES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RW_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_RW"
      + id                 = (known after apply)
      + privileges         = [
          + "DELETE",
          + "INSERT",
          + "SELECT",
          + "TRUNCATE",
          + "UPDATE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.LIQUIBASE"
              + object_type_plural = "TABLES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["VIEWS"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RW_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_RW"
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.LIQUIBASE"
              + object_type_plural = "VIEWS"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RW_SCHEMA_GRANTS will be created
  + resource "snowflake_grant_privileges_to_database_role" "RW_SCHEMA_GRANTS" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_RW"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema {
          + schema_name = "LIQUIBASE_TEST.LIQUIBASE"
        }
    }

Plan: 45 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

<details><summary>Apply output</summary>

```
terraform
Running apply in HCP Terraform. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/sf-terraform-actions/gh-actions-dev/runs/run-1LpZLGFbzDSxkHnK

Waiting for the plan to start...

Terraform v1.9.3
on linux_amd64
Initializing plugins and modules...
╷
│ Warning: Argument is deprecated
│
│   with provider["registry.terraform.io/snowflake-labs/snowflake"],
│   on <empty> line 0:
│   (source code not available)
│
│ Specify the region as part of the account parameter
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.LIQUIBASE_TEST.snowflake_database.DATABASE will be created
  + resource "snowflake_database" "DATABASE" {
      + catalog                                       = (known after apply)
      + data_retention_time_in_days                   = 1
      + default_ddl_collation                         = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + id                                            = (known after apply)
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "LIQUIBASE_TEST"
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.LIQUIBASE_TEST.snowflake_schema.LIQUIBASE_SCHEMA[0] will be created
  + resource "snowflake_schema" "LIQUIBASE_SCHEMA" {
      + comment             = "Schema for managing Liquibase. Only the db deploy user has RW"
      + data_retention_days = 7
      + database            = "LIQUIBASE_TEST"
      + id                  = (known after apply)
      + is_managed          = true
      + is_transient        = false
      + name                = "LIQUIBASE"
    }

  # module.LIQUIBASE_TEST.snowflake_schema.SCHEMA["TEST_STUFF"] will be created
  + resource "snowflake_schema" "SCHEMA" {
      + data_retention_days = 1
      + database            = "LIQUIBASE_TEST"
      + id                  = (known after apply)
      + is_managed          = false
      + is_transient        = false
      + name                = "TEST_STUFF"
        # (1 unchanged attribute hidden)
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_database_role.ELEV_ROLE will be created
  + resource "snowflake_database_role" "ELEV_ROLE" {
      + database = "LIQUIBASE_TEST"
      + id       = (known after apply)
      + name     = "AR_TEST_STUFF_ELEV"
        # (1 unchanged attribute hidden)
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_database_role.EXEC_ROLE will be created
  + resource "snowflake_database_role" "EXEC_ROLE" {
      + database = "LIQUIBASE_TEST"
      + id       = (known after apply)
      + name     = "AR_TEST_STUFF_EXEC"
        # (1 unchanged attribute hidden)
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_database_role.RO_ROLE will be created
  + resource "snowflake_database_role" "RO_ROLE" {
      + database = "LIQUIBASE_TEST"
      + id       = (known after apply)
      + name     = "AR_TEST_STUFF_RO"
        # (1 unchanged attribute hidden)
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_database_role.RW_ROLE will be created
  + resource "snowflake_database_role" "RW_ROLE" {
      + database = "LIQUIBASE_TEST"
      + id       = (known after apply)
      + name     = "AR_TEST_STUFF_RW"
        # (1 unchanged attribute hidden)
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_database_role.GRANT_ELEV_DB_ROLE[0] will be created
  + resource "snowflake_grant_database_role" "GRANT_ELEV_DB_ROLE" {
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_ELEV"
      + id                 = (known after apply)
      + parent_role_name   = "LIQUIBASE_DEPLOY"
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_database_role.GRANT_EXEC_DB_ROLE[0] will be created
  + resource "snowflake_grant_database_role" "GRANT_EXEC_DB_ROLE" {
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_EXEC"
      + id                 = (known after apply)
      + parent_role_name   = "LIQUIBASE_DEPLOY"
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["SEQUENCES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "ELEV_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_ELEV"
      + id                 = (known after apply)
      + privileges         = [
          + "ALL",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.TEST_STUFF"
              + object_type_plural = "SEQUENCES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["TABLES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "ELEV_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_ELEV"
      + id                 = (known after apply)
      + privileges         = [
          + "ALL",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.TEST_STUFF"
              + object_type_plural = "TABLES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["VIEWS"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "ELEV_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_ELEV"
      + id                 = (known after apply)
      + privileges         = [
          + "ALL",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.TEST_STUFF"
              + object_type_plural = "VIEWS"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.ELEV_SCHEMA_GRANTS will be created
  + resource "snowflake_grant_privileges_to_database_role" "ELEV_SCHEMA_GRANTS" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_ELEV"
      + id                 = (known after apply)
      + privileges         = [
          + "CREATE FUNCTION",
          + "CREATE PROCEDURE",
          + "CREATE SEQUENCE",
          + "CREATE TABLE",
          + "CREATE VIEW",
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema {
          + schema_name = "LIQUIBASE_TEST.TEST_STUFF"
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.EXEC_FUTURE_GRANT["FUNCTIONS"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "EXEC_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_EXEC"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.TEST_STUFF"
              + object_type_plural = "FUNCTIONS"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.EXEC_FUTURE_GRANT["PROCEDURES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "EXEC_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_EXEC"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.TEST_STUFF"
              + object_type_plural = "PROCEDURES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.EXEC_SCHEMA_GRANTS will be created
  + resource "snowflake_grant_privileges_to_database_role" "EXEC_SCHEMA_GRANTS" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_EXEC"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema {
          + schema_name = "LIQUIBASE_TEST.TEST_STUFF"
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["SEQUENCES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RO_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_RO"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.TEST_STUFF"
              + object_type_plural = "SEQUENCES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["TABLES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RO_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_RO"
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.TEST_STUFF"
              + object_type_plural = "TABLES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["VIEWS"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RO_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_RO"
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.TEST_STUFF"
              + object_type_plural = "VIEWS"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RO_SCHEMA_GRANTS will be created
  + resource "snowflake_grant_privileges_to_database_role" "RO_SCHEMA_GRANTS" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_RO"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema {
          + schema_name = "LIQUIBASE_TEST.TEST_STUFF"
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["SEQUENCES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RW_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_RW"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.TEST_STUFF"
              + object_type_plural = "SEQUENCES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["TABLES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RW_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_RW"
      + id                 = (known after apply)
      + privileges         = [
          + "DELETE",
          + "INSERT",
          + "SELECT",
          + "TRUNCATE",
          + "UPDATE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.TEST_STUFF"
              + object_type_plural = "TABLES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["VIEWS"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RW_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_RW"
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.TEST_STUFF"
              + object_type_plural = "VIEWS"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RW_SCHEMA_GRANTS will be created
  + resource "snowflake_grant_privileges_to_database_role" "RW_SCHEMA_GRANTS" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_TEST_STUFF_RW"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema {
          + schema_name = "LIQUIBASE_TEST.TEST_STUFF"
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_database_role.ELEV_ROLE will be created
  + resource "snowflake_database_role" "ELEV_ROLE" {
      + database = "LIQUIBASE_TEST"
      + id       = (known after apply)
      + name     = "AR_LIQUIBASE_ELEV"
        # (1 unchanged attribute hidden)
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_database_role.EXEC_ROLE will be created
  + resource "snowflake_database_role" "EXEC_ROLE" {
      + database = "LIQUIBASE_TEST"
      + id       = (known after apply)
      + name     = "AR_LIQUIBASE_EXEC"
        # (1 unchanged attribute hidden)
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_database_role.RO_ROLE will be created
  + resource "snowflake_database_role" "RO_ROLE" {
      + database = "LIQUIBASE_TEST"
      + id       = (known after apply)
      + name     = "AR_LIQUIBASE_RO"
        # (1 unchanged attribute hidden)
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_database_role.RW_ROLE will be created
  + resource "snowflake_database_role" "RW_ROLE" {
      + database = "LIQUIBASE_TEST"
      + id       = (known after apply)
      + name     = "AR_LIQUIBASE_RW"
        # (1 unchanged attribute hidden)
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_database_role.GRANT_ELEV_DB_ROLE[0] will be created
  + resource "snowflake_grant_database_role" "GRANT_ELEV_DB_ROLE" {
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_ELEV"
      + id                 = (known after apply)
      + parent_role_name   = "LIQUIBASE_DEPLOY"
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_database_role.GRANT_EXEC_DB_ROLE[0] will be created
  + resource "snowflake_grant_database_role" "GRANT_EXEC_DB_ROLE" {
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_EXEC"
      + id                 = (known after apply)
      + parent_role_name   = "LIQUIBASE_DEPLOY"
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["SEQUENCES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "ELEV_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_ELEV"
      + id                 = (known after apply)
      + privileges         = [
          + "ALL",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.LIQUIBASE"
              + object_type_plural = "SEQUENCES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["TABLES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "ELEV_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_ELEV"
      + id                 = (known after apply)
      + privileges         = [
          + "ALL",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.LIQUIBASE"
              + object_type_plural = "TABLES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["VIEWS"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "ELEV_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_ELEV"
      + id                 = (known after apply)
      + privileges         = [
          + "ALL",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.LIQUIBASE"
              + object_type_plural = "VIEWS"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.ELEV_SCHEMA_GRANTS will be created
  + resource "snowflake_grant_privileges_to_database_role" "ELEV_SCHEMA_GRANTS" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_ELEV"
      + id                 = (known after apply)
      + privileges         = [
          + "CREATE FUNCTION",
          + "CREATE PROCEDURE",
          + "CREATE SEQUENCE",
          + "CREATE TABLE",
          + "CREATE VIEW",
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema {
          + schema_name = "LIQUIBASE_TEST.LIQUIBASE"
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.EXEC_FUTURE_GRANT["FUNCTIONS"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "EXEC_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_EXEC"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.LIQUIBASE"
              + object_type_plural = "FUNCTIONS"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.EXEC_FUTURE_GRANT["PROCEDURES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "EXEC_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_EXEC"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.LIQUIBASE"
              + object_type_plural = "PROCEDURES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.EXEC_SCHEMA_GRANTS will be created
  + resource "snowflake_grant_privileges_to_database_role" "EXEC_SCHEMA_GRANTS" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_EXEC"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema {
          + schema_name = "LIQUIBASE_TEST.LIQUIBASE"
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["SEQUENCES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RO_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_RO"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.LIQUIBASE"
              + object_type_plural = "SEQUENCES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["TABLES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RO_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_RO"
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.LIQUIBASE"
              + object_type_plural = "TABLES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["VIEWS"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RO_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_RO"
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.LIQUIBASE"
              + object_type_plural = "VIEWS"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RO_SCHEMA_GRANTS will be created
  + resource "snowflake_grant_privileges_to_database_role" "RO_SCHEMA_GRANTS" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_RO"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema {
          + schema_name = "LIQUIBASE_TEST.LIQUIBASE"
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["SEQUENCES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RW_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_RW"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.LIQUIBASE"
              + object_type_plural = "SEQUENCES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["TABLES"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RW_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_RW"
      + id                 = (known after apply)
      + privileges         = [
          + "DELETE",
          + "INSERT",
          + "SELECT",
          + "TRUNCATE",
          + "UPDATE",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.LIQUIBASE"
              + object_type_plural = "TABLES"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["VIEWS"] will be created
  + resource "snowflake_grant_privileges_to_database_role" "RW_FUTURE_GRANT" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_RW"
      + id                 = (known after apply)
      + privileges         = [
          + "SELECT",
        ]
      + with_grant_option  = false

      + on_schema_object {
          + future {
              + in_schema          = "LIQUIBASE_TEST.LIQUIBASE"
              + object_type_plural = "VIEWS"
            }
        }
    }

  # module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RW_SCHEMA_GRANTS will be created
  + resource "snowflake_grant_privileges_to_database_role" "RW_SCHEMA_GRANTS" {
      + all_privileges     = false
      + always_apply       = false
      + database_role_name = "LIQUIBASE_TEST.AR_LIQUIBASE_RW"
      + id                 = (known after apply)
      + privileges         = [
          + "USAGE",
        ]
      + with_grant_option  = false

      + on_schema {
          + schema_name = "LIQUIBASE_TEST.LIQUIBASE"
        }
    }

Plan: 45 to add, 0 to change, 0 to destroy.

module.LIQUIBASE_TEST.snowflake_database.DATABASE: Creating...
module.LIQUIBASE_TEST.snowflake_database.DATABASE: Creation complete after 0s [id=LIQUIBASE_TEST]
module.LIQUIBASE_TEST.snowflake_schema.LIQUIBASE_SCHEMA[0]: Creating...
module.LIQUIBASE_TEST.snowflake_schema.SCHEMA["TEST_STUFF"]: Creating...
module.LIQUIBASE_TEST.snowflake_schema.LIQUIBASE_SCHEMA[0]: Creation complete after 0s [id=LIQUIBASE_TEST|LIQUIBASE]
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_database_role.RW_ROLE: Creating...
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_database_role.EXEC_ROLE: Creating...
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_database_role.ELEV_ROLE: Creating...
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_database_role.RO_ROLE: Creating...
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_database_role.RW_ROLE: Creation complete after 1s [id=LIQUIBASE_TEST|AR_LIQUIBASE_RW]
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["SEQUENCES"]: Creating...
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["VIEWS"]: Creating...
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RW_SCHEMA_GRANTS: Creating...
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["TABLES"]: Creating...
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_database_role.EXEC_ROLE: Creation complete after 1s [id=LIQUIBASE_TEST|AR_LIQUIBASE_EXEC]
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.EXEC_SCHEMA_GRANTS: Creating...
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.EXEC_FUTURE_GRANT["FUNCTIONS"]: Creating...
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.EXEC_FUTURE_GRANT["PROCEDURES"]: Creating...
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_database_role.RO_ROLE: Creation complete after 1s [id=LIQUIBASE_TEST|AR_LIQUIBASE_RO]
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_database_role.ELEV_ROLE: Creation complete after 1s [id=LIQUIBASE_TEST|AR_LIQUIBASE_ELEV]
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_database_role.GRANT_EXEC_DB_ROLE[0]: Creating...
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["TABLES"]: Creating...
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RO_SCHEMA_GRANTS: Creating...
module.LIQUIBASE_TEST.snowflake_schema.SCHEMA["TEST_STUFF"]: Creation complete after 1s [id=LIQUIBASE_TEST|TEST_STUFF]
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["VIEWS"]: Creating...
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RW_SCHEMA_GRANTS: Creation complete after 0s [id="LIQUIBASE_TEST"."AR_LIQUIBASE_RW"|false|false|USAGE|OnSchema|OnSchema|"LIQUIBASE_TEST"."LIQUIBASE"]
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["SEQUENCES"]: Creating...
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["SEQUENCES"]: Creation complete after 0s [id="LIQUIBASE_TEST"."AR_LIQUIBASE_RW"|false|false|USAGE|OnSchemaObject|OnFuture|SEQUENCES|InSchema|"LIQUIBASE_TEST"."LIQUIBASE"]
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["SEQUENCES"]: Creating...
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["VIEWS"]: Creation complete after 0s [id="LIQUIBASE_TEST"."AR_LIQUIBASE_RW"|false|false|SELECT|OnSchemaObject|OnFuture|VIEWS|InSchema|"LIQUIBASE_TEST"."LIQUIBASE"]
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["TABLES"]: Creating...
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.EXEC_FUTURE_GRANT["FUNCTIONS"]: Creation complete after 0s [id="LIQUIBASE_TEST"."AR_LIQUIBASE_EXEC"|false|false|USAGE|OnSchemaObject|OnFuture|FUNCTIONS|InSchema|"LIQUIBASE_TEST"."LIQUIBASE"]
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["VIEWS"]: Creating...
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["TABLES"]: Creation complete after 0s [id="LIQUIBASE_TEST"."AR_LIQUIBASE_RO"|false|false|SELECT|OnSchemaObject|OnFuture|TABLES|InSchema|"LIQUIBASE_TEST"."LIQUIBASE"]
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_database_role.GRANT_ELEV_DB_ROLE[0]: Creating...
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["SEQUENCES"]: Creation complete after 0s [id="LIQUIBASE_TEST"."AR_LIQUIBASE_ELEV"|false|false|ALL|OnSchemaObject|OnFuture|SEQUENCES|InSchema|"LIQUIBASE_TEST"."LIQUIBASE"]
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["VIEWS"]: Creation complete after 0s [id="LIQUIBASE_TEST"."AR_LIQUIBASE_RO"|false|false|SELECT|OnSchemaObject|OnFuture|VIEWS|InSchema|"LIQUIBASE_TEST"."LIQUIBASE"]
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.ELEV_SCHEMA_GRANTS: Creating...
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_database_role.RO_ROLE: Creating...
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RO_SCHEMA_GRANTS: Creation complete after 0s [id="LIQUIBASE_TEST"."AR_LIQUIBASE_RO"|false|false|USAGE|OnSchema|OnSchema|"LIQUIBASE_TEST"."LIQUIBASE"]
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_database_role.ELEV_ROLE: Creating...
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["TABLES"]: Creation complete after 0s [id="LIQUIBASE_TEST"."AR_LIQUIBASE_RW"|false|false|INSERT,DELETE,TRUNCATE,SELECT,UPDATE|OnSchemaObject|OnFuture|TABLES|InSchema|"LIQUIBASE_TEST"."LIQUIBASE"]
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["SEQUENCES"]: Creation complete after 0s [id="LIQUIBASE_TEST"."AR_LIQUIBASE_RO"|false|false|USAGE|OnSchemaObject|OnFuture|SEQUENCES|InSchema|"LIQUIBASE_TEST"."LIQUIBASE"]
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_database_role.EXEC_ROLE: Creating...
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_database_role.RW_ROLE: Creating...
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.EXEC_SCHEMA_GRANTS: Creation complete after 0s [id="LIQUIBASE_TEST"."AR_LIQUIBASE_EXEC"|false|false|USAGE|OnSchema|OnSchema|"LIQUIBASE_TEST"."LIQUIBASE"]
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["TABLES"]: Creation complete after 0s [id="LIQUIBASE_TEST"."AR_LIQUIBASE_ELEV"|false|false|ALL|OnSchemaObject|OnFuture|TABLES|InSchema|"LIQUIBASE_TEST"."LIQUIBASE"]
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["VIEWS"]: Creation complete after 0s [id="LIQUIBASE_TEST"."AR_LIQUIBASE_ELEV"|false|false|ALL|OnSchemaObject|OnFuture|VIEWS|InSchema|"LIQUIBASE_TEST"."LIQUIBASE"]
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.EXEC_FUTURE_GRANT["PROCEDURES"]: Creation complete after 0s [id="LIQUIBASE_TEST"."AR_LIQUIBASE_EXEC"|false|false|USAGE|OnSchemaObject|OnFuture|PROCEDURES|InSchema|"LIQUIBASE_TEST"."LIQUIBASE"]
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_database_role.RO_ROLE: Creation complete after 0s [id=LIQUIBASE_TEST|AR_TEST_STUFF_RO]
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RO_SCHEMA_GRANTS: Creating...
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["SEQUENCES"]: Creating...
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["TABLES"]: Creating...
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["VIEWS"]: Creating...
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_database_role.EXEC_ROLE: Creation complete after 0s [id=LIQUIBASE_TEST|AR_TEST_STUFF_EXEC]
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.EXEC_SCHEMA_GRANTS: Creating...
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.EXEC_FUTURE_GRANT["PROCEDURES"]: Creating...
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.EXEC_FUTURE_GRANT["FUNCTIONS"]: Creating...
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_database_role.RW_ROLE: Creation complete after 0s [id=LIQUIBASE_TEST|AR_TEST_STUFF_RW]
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_database_role.GRANT_EXEC_DB_ROLE[0]: Creating...
module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_privileges_to_database_role.ELEV_SCHEMA_GRANTS: Creation complete after 0s [id="LIQUIBASE_TEST"."AR_LIQUIBASE_ELEV"|false|false|CREATE PROCEDURE,CREATE TABLE,CREATE VIEW,CREATE SEQUENCE,USAGE,CREATE FUNCTION|OnSchema|OnSchema|"LIQUIBASE_TEST"."LIQUIBASE"]
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["SEQUENCES"]: Creating...
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_database_role.ELEV_ROLE: Creation complete after 0s [id=LIQUIBASE_TEST|AR_TEST_STUFF_ELEV]
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["TABLES"]: Creating...
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RW_SCHEMA_GRANTS: Creating...
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RO_SCHEMA_GRANTS: Creation complete after 1s [id="LIQUIBASE_TEST"."AR_TEST_STUFF_RO"|false|false|USAGE|OnSchema|OnSchema|"LIQUIBASE_TEST"."TEST_STUFF"]
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["VIEWS"]: Creating...
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["SEQUENCES"]: Creation complete after 1s [id="LIQUIBASE_TEST"."AR_TEST_STUFF_RO"|false|false|USAGE|OnSchemaObject|OnFuture|SEQUENCES|InSchema|"LIQUIBASE_TEST"."TEST_STUFF"]
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_database_role.GRANT_ELEV_DB_ROLE[0]: Creating...
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["SEQUENCES"]: Creation complete after 1s [id="LIQUIBASE_TEST"."AR_TEST_STUFF_RW"|false|false|USAGE|OnSchemaObject|OnFuture|SEQUENCES|InSchema|"LIQUIBASE_TEST"."TEST_STUFF"]
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["TABLES"]: Creating...
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["TABLES"]: Creation complete after 1s [id="LIQUIBASE_TEST"."AR_TEST_STUFF_RO"|false|false|SELECT|OnSchemaObject|OnFuture|TABLES|InSchema|"LIQUIBASE_TEST"."TEST_STUFF"]
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["VIEWS"]: Creating...
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["SEQUENCES"]: Creating...
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.EXEC_FUTURE_GRANT["FUNCTIONS"]: Creation complete after 1s [id="LIQUIBASE_TEST"."AR_TEST_STUFF_EXEC"|false|false|USAGE|OnSchemaObject|OnFuture|FUNCTIONS|InSchema|"LIQUIBASE_TEST"."TEST_STUFF"]
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.EXEC_FUTURE_GRANT["PROCEDURES"]: Creation complete after 1s [id="LIQUIBASE_TEST"."AR_TEST_STUFF_EXEC"|false|false|USAGE|OnSchemaObject|OnFuture|PROCEDURES|InSchema|"LIQUIBASE_TEST"."TEST_STUFF"]
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.ELEV_SCHEMA_GRANTS: Creating...
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RO_FUTURE_GRANT["VIEWS"]: Creation complete after 1s [id="LIQUIBASE_TEST"."AR_TEST_STUFF_RO"|false|false|SELECT|OnSchemaObject|OnFuture|VIEWS|InSchema|"LIQUIBASE_TEST"."TEST_STUFF"]
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["TABLES"]: Creation complete after 0s [id="LIQUIBASE_TEST"."AR_TEST_STUFF_ELEV"|false|false|ALL|OnSchemaObject|OnFuture|TABLES|InSchema|"LIQUIBASE_TEST"."TEST_STUFF"]
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["TABLES"]: Creation complete after 1s [id="LIQUIBASE_TEST"."AR_TEST_STUFF_RW"|false|false|INSERT,DELETE,TRUNCATE,SELECT,UPDATE|OnSchemaObject|OnFuture|TABLES|InSchema|"LIQUIBASE_TEST"."TEST_STUFF"]
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["SEQUENCES"]: Creation complete after 0s [id="LIQUIBASE_TEST"."AR_TEST_STUFF_ELEV"|false|false|ALL|OnSchemaObject|OnFuture|SEQUENCES|InSchema|"LIQUIBASE_TEST"."TEST_STUFF"]
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RW_SCHEMA_GRANTS: Creation complete after 1s [id="LIQUIBASE_TEST"."AR_TEST_STUFF_RW"|false|false|USAGE|OnSchema|OnSchema|"LIQUIBASE_TEST"."TEST_STUFF"]
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.EXEC_SCHEMA_GRANTS: Creation complete after 1s [id="LIQUIBASE_TEST"."AR_TEST_STUFF_EXEC"|false|false|USAGE|OnSchema|OnSchema|"LIQUIBASE_TEST"."TEST_STUFF"]
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.ELEV_FUTURE_GRANT["VIEWS"]: Creation complete after 0s [id="LIQUIBASE_TEST"."AR_TEST_STUFF_ELEV"|false|false|ALL|OnSchemaObject|OnFuture|VIEWS|InSchema|"LIQUIBASE_TEST"."TEST_STUFF"]
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.RW_FUTURE_GRANT["VIEWS"]: Creation complete after 0s [id="LIQUIBASE_TEST"."AR_TEST_STUFF_RW"|false|false|SELECT|OnSchemaObject|OnFuture|VIEWS|InSchema|"LIQUIBASE_TEST"."TEST_STUFF"]
module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_privileges_to_database_role.ELEV_SCHEMA_GRANTS: Creation complete after 0s [id="LIQUIBASE_TEST"."AR_TEST_STUFF_ELEV"|false|false|CREATE PROCEDURE,CREATE TABLE,CREATE VIEW,CREATE SEQUENCE,USAGE,CREATE FUNCTION|OnSchema|OnSchema|"LIQUIBASE_TEST"."TEST_STUFF"]
╷
│ Error: [errors.go:22] object does not exist or not authorized
│
│   with module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_database_role.GRANT_EXEC_DB_ROLE[0],
│   on modules/base_rbac_db_roles/main.tf line 139, in resource "snowflake_grant_database_role" "GRANT_EXEC_DB_ROLE":
│  139: resource "snowflake_grant_database_role" "GRANT_EXEC_DB_ROLE" {
│
╵
╷
│ Error: [errors.go:22] object does not exist or not authorized
│
│   with module.LIQUIBASE_TEST.module.CREATE_LIQUIBASE_DB_ROLES[0].snowflake_grant_database_role.GRANT_ELEV_DB_ROLE[0],
│   on modules/base_rbac_db_roles/main.tf line 132, in resource "snowflake_grant_database_role" "GRANT_ELEV_DB_ROLE":
│  132: resource "snowflake_grant_database_role" "GRANT_ELEV_DB_ROLE" {
│
╵
╷
│ Error: [errors.go:22] object does not exist or not authorized
│
│   with module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_database_role.GRANT_ELEV_DB_ROLE[0],
│   on modules/base_rbac_db_roles/main.tf line 132, in resource "snowflake_grant_database_role" "GRANT_ELEV_DB_ROLE":
│  132: resource "snowflake_grant_database_role" "GRANT_ELEV_DB_ROLE" {
│
╵
╷
│ Error: [errors.go:22] object does not exist or not authorized
│
│   with module.LIQUIBASE_TEST.module.CREATE_BASE_DB_ROLES["TEST_STUFF"].snowflake_grant_database_role.GRANT_EXEC_DB_ROLE[0],
│   on modules/base_rbac_db_roles/main.tf line 139, in resource "snowflake_grant_database_role" "GRANT_EXEC_DB_ROLE":
│  139: resource "snowflake_grant_database_role" "GRANT_EXEC_DB_ROLE" {
│
╵
╷
│ Warning: Argument is deprecated
│
│   with provider["registry.terraform.io/snowflake-labs/snowflake"],
│   on <empty> line 0:
│   (source code not available)
│
│ Specify the region as part of the account parameter
╵
Operation failed: failed running terraform apply (exit 1)

```

</details>